In [4]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

s = pd.Series([1,2,3,5,np.nan,6,7,8,9])

print(s)

dates = pd.date_range('20150102', periods=6)

print(dates)

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

print(df)

0     1
1     2
2     3
3     5
4   NaN
5     6
6     7
7     8
8     9
dtype: float64
DatetimeIndex(['2015-01-02', '2015-01-03', '2015-01-04', '2015-01-05',
               '2015-01-06', '2015-01-07'],
              dtype='datetime64[ns]', freq='D', tz=None)
                   A         B         C         D
2015-01-02  1.049644  0.118746  0.856282 -0.783489
2015-01-03  1.349421 -0.097758  1.044237  0.195403
2015-01-04  1.302249  0.540427  0.493124 -0.795228
2015-01-05  0.496369  0.369501 -0.907691  1.509578
2015-01-06 -0.043093 -0.048168  0.558135  2.345246
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [6]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df2.head()

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [9]:
df2.tail(2)

   A          B  C  D      E    F
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [10]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [11]:
df.index

DatetimeIndex(['2015-01-02', '2015-01-03', '2015-01-04', '2015-01-05',
               '2015-01-06', '2015-01-07'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [12]:
df

                   A         B         C         D
2015-01-02  1.049644  0.118746  0.856282 -0.783489
2015-01-03  1.349421 -0.097758  1.044237  0.195403
2015-01-04  1.302249  0.540427  0.493124 -0.795228
2015-01-05  0.496369  0.369501 -0.907691  1.509578
2015-01-06 -0.043093 -0.048168  0.558135  2.345246
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.values

array([[  1.04964440e+00,   1.18746264e-01,   8.56282093e-01,
         -7.83488726e-01],
       [  1.34942145e+00,  -9.77576808e-02,   1.04423668e+00,
          1.95403004e-01],
       [  1.30224908e+00,   5.40426733e-01,   4.93124484e-01,
         -7.95228198e-01],
       [  4.96369002e-01,   3.69501349e-01,  -9.07690920e-01,
          1.50957810e+00],
       [ -4.30933699e-02,  -4.81682459e-02,   5.58134580e-01,
          2.34524563e+00],
       [  6.74029872e-04,  -4.03790874e-01,  -2.10078060e-01,
         -1.66623369e+00]])

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.692544  0.079826  0.305668  0.134213
std    0.630727  0.340407  0.732908  1.531776
min   -0.043093 -0.403791 -0.907691 -1.666234
25%    0.124598 -0.085360 -0.034277 -0.792293
50%    0.773007  0.035289  0.525630 -0.294043
75%    1.239098  0.306813  0.781745  1.181034
max    1.349421  0.540427  1.044237  2.345246

In [16]:
df.T

   2015-01-02  2015-01-03  2015-01-04  2015-01-05  2015-01-06  2015-01-07
A    1.049644    1.349421    1.302249    0.496369   -0.043093    0.000674
B    0.118746   -0.097758    0.540427    0.369501   -0.048168   -0.403791
C    0.856282    1.044237    0.493124   -0.907691    0.558135   -0.210078
D   -0.783489    0.195403   -0.795228    1.509578    2.345246   -1.666234

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2015-01-02 -0.783489  0.856282  0.118746  1.049644
2015-01-03  0.195403  1.044237 -0.097758  1.349421
2015-01-04 -0.795228  0.493124  0.540427  1.302249
2015-01-05  1.509578 -0.907691  0.369501  0.496369
2015-01-06  2.345246  0.558135 -0.048168 -0.043093
2015-01-07 -1.666234 -0.210078 -0.403791  0.000674

In [18]:
df.sort(columns='B')

                   A         B         C         D
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234
2015-01-03  1.349421 -0.097758  1.044237  0.195403
2015-01-06 -0.043093 -0.048168  0.558135  2.345246
2015-01-02  1.049644  0.118746  0.856282 -0.783489
2015-01-05  0.496369  0.369501 -0.907691  1.509578
2015-01-04  1.302249  0.540427  0.493124 -0.795228

In [19]:
df['A']

2015-01-02    1.049644
2015-01-03    1.349421
2015-01-04    1.302249
2015-01-05    0.496369
2015-01-06   -0.043093
2015-01-07    0.000674
Freq: D, Name: A, dtype: float64

In [21]:
df.loc[dates[0]]

A    1.049644
B    0.118746
C    0.856282
D   -0.783489
Name: 2015-01-02 00:00:00, dtype: float64

In [22]:
df.loc[:,['A','B']]

                   A         B
2015-01-02  1.049644  0.118746
2015-01-03  1.349421 -0.097758
2015-01-04  1.302249  0.540427
2015-01-05  0.496369  0.369501
2015-01-06 -0.043093 -0.048168
2015-01-07  0.000674 -0.403791

In [25]:
df.loc['20150102':'20150104',['A','B']]

                   A         B
2015-01-02  1.049644  0.118746
2015-01-03  1.349421 -0.097758
2015-01-04  1.302249  0.540427

In [26]:
df.loc['20150102':'20150104','A']

2015-01-02    1.049644
2015-01-03    1.349421
2015-01-04    1.302249
Freq: D, Name: A, dtype: float64

In [27]:
df.loc['20150102','A']

1.0496443960300577

In [32]:
df.loc[dates[0],'A']

1.0496443960300577

In [33]:
dates[0]

Timestamp('2015-01-02 00:00:00', offset='D')

In [35]:
dates[0]

Timestamp('2015-01-02 00:00:00', offset='D')

In [36]:
df.iloc[0,1]

0.11874626448847449

In [39]:
df.at[dates[0],'B']

0.11874626448847449

In [40]:
df.iloc[0]

A    1.049644
B    0.118746
C    0.856282
D   -0.783489
Name: 2015-01-02 00:00:00, dtype: float64

In [41]:
df

                   A         B         C         D
2015-01-02  1.049644  0.118746  0.856282 -0.783489
2015-01-03  1.349421 -0.097758  1.044237  0.195403
2015-01-04  1.302249  0.540427  0.493124 -0.795228
2015-01-05  0.496369  0.369501 -0.907691  1.509578
2015-01-06 -0.043093 -0.048168  0.558135  2.345246
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234

In [42]:
df[df.A > 0]

                   A         B         C         D
2015-01-02  1.049644  0.118746  0.856282 -0.783489
2015-01-03  1.349421 -0.097758  1.044237  0.195403
2015-01-04  1.302249  0.540427  0.493124 -0.795228
2015-01-05  0.496369  0.369501 -0.907691  1.509578
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234

In [43]:
df[df > 0]

                   A         B         C         D
2015-01-02  1.049644  0.118746  0.856282       NaN
2015-01-03  1.349421       NaN  1.044237  0.195403
2015-01-04  1.302249  0.540427  0.493124       NaN
2015-01-05  0.496369  0.369501       NaN  1.509578
2015-01-06       NaN       NaN  0.558135  2.345246
2015-01-07  0.000674       NaN       NaN       NaN

In [44]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']

In [46]:
df2[df2.E.isin(['two','three'])]

                   A         B         C         D      E
2015-01-04  1.302249  0.540427  0.493124 -0.795228    two
2015-01-05  0.496369  0.369501 -0.907691  1.509578  three
2015-01-07  0.000674 -0.403791 -0.210078 -1.666234  three

In [65]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20150102', periods=6))

In [48]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [51]:
df['F'] = s1
df.at[dates[0],'A']

1.0496443960300577

In [52]:
df.at[dates[0],'A'] = 0

In [53]:
df.iat[0,1] = 0

In [54]:
df.loc[:,'D'] = np.array([5] * len(df))

In [55]:
df

                   A         B         C  D   F
2015-01-02  0.000000  0.000000  0.856282  5 NaN
2015-01-03  1.349421 -0.097758  1.044237  5 NaN
2015-01-04  1.302249  0.540427  0.493124  5 NaN
2015-01-05  0.496369  0.369501 -0.907691  5 NaN
2015-01-06 -0.043093 -0.048168  0.558135  5 NaN
2015-01-07  0.000674 -0.403791 -0.210078  5 NaN

In [61]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [57]:
df

                   A         B         C  D   F
2015-01-02  0.000000  0.000000  0.856282  5 NaN
2015-01-03  1.349421 -0.097758  1.044237  5 NaN
2015-01-04  1.302249  0.540427  0.493124  5 NaN
2015-01-05  0.496369  0.369501 -0.907691  5 NaN
2015-01-06 -0.043093 -0.048168  0.558135  5 NaN
2015-01-07  0.000674 -0.403791 -0.210078  5 NaN

In [66]:
df['F'] = s1

In [67]:
df

                   A         B         C  D  F   G
2015-01-02  0.000000  0.000000  0.856282  5  1 NaN
2015-01-03  1.349421 -0.097758  1.044237  5  2 NaN
2015-01-04  1.302249  0.540427  0.493124  5  3 NaN
2015-01-05  0.496369  0.369501 -0.907691  5  4 NaN
2015-01-06 -0.043093 -0.048168  0.558135  5  5 NaN
2015-01-07  0.000674 -0.403791 -0.210078  5  6 NaN